OPERATION ON DATA IN THE PANDAS LABRERY

*** Universal fanctions: save index ***

In [5]:
import pandas as pd
import numpy as np

In [8]:
rng = np.random.RandomState(42)
ser = pd.Series(rng.randint(0, 10, 4))
ser

0    6
1    3
2    7
3    4
dtype: int64

In [16]:
df = pd.DataFrame(rng.randint(0, 10, (3, 4)),
                  columns=['A', 'B', 'C', 'D'])
df

   A  B  C  D
0  1  9  3  7
1  6  8  7  4
2  1  4  7  9

In [14]:
np.exp(ser)

0     403.428793
1      20.085537
2    1096.633158
3      54.598150
dtype: float64

In [17]:
np.sin(df * np.pi / 4)

          A             B         C             D
0  0.707107  7.071068e-01  0.707107 -7.071068e-01
1 -1.000000 -2.449294e-16 -0.707107  1.224647e-16
2  0.707107  1.224647e-16 -0.707107  7.071068e-01

*** Universal fanctions: level index ***

Leveling indexes in Series objects

In [18]:
area = pd.Series({'Alaska': 1723337, 'Texas': 695662, 'California': 423967}, name = 'area')
population = pd.Series({'California': 38332521, 'Texas': 26448193, 'New York': 19651127}, name = 'population')

In [19]:
population / area

Alaska              NaN
California    90.413926
New York            NaN
Texas         38.018740
dtype: float64

In [21]:
area.index.union(population.index)

Index(['Alaska', 'California', 'New York', 'Texas'], dtype='object')

In [22]:
A = pd.Series([2, 4, 6], index=[0, 1, 2])
B = pd.Series([1, 3, 5], index=[1, 2, 3])
A + B

0    NaN
1    5.0
2    9.0
3    NaN
dtype: float64

In [24]:
A.add(B, fill_value=0)

0    2.0
1    5.0
2    9.0
3    5.0
dtype: float64

Leveling indexes in DataFrame objects

In [25]:
A = pd.DataFrame(rng.randint(0, 20, (2, 2)),
                 columns=list('AB'))
A

    A   B
0  12   8
1  14  12

In [26]:
B = pd.DataFrame(rng.randint(0, 10, (3, 3)),
                 columns=list('BAC'))
B

   B  A  C
0  0  8  6
1  8  7  0
2  7  7  2

In [27]:
A + B

      A     B   C
0  20.0   8.0 NaN
1  21.0  20.0 NaN
2   NaN   NaN NaN

In [28]:
A.stack()

0  A    12
   B     8
1  A    14
   B    12
dtype: int64

In [29]:
fill = A.stack().mean()
A.add(B, fill_value=fill)

      A     B     C
0  20.0   8.0  17.5
1  21.0  20.0  11.5
2  18.5  18.5  13.5

*** Universal fanctions: make operations between DataFrame and Series objects ***

In [33]:
A = rng.randint(10, size=(3, 4))
A

array([[6, 0, 3, 3],
       [4, 6, 6, 3],
       [6, 2, 5, 1]])

In [34]:
A - A[0]

array([[ 0,  0,  0,  0],
       [-2,  6,  3,  0],
       [ 0,  2,  2, -2]])

In [35]:
df = pd.DataFrame(A, columns=list('QRST'))
df - df.iloc[0]

   Q  R  S  T
0  0  0  0  0
1 -2  6  3  0
2  0  2  2 -2

In [36]:
df.subtract(df['R'], axis=0)

   Q  R  S  T
0  6  0  3  3
1 -2  0  0 -3
2  4  0  3 -1

In [38]:
halfrow = df.iloc[0, ::2]
halfrow

Q    6
S    3
Name: 0, dtype: int64

In [39]:
df - halfrow

     Q   R    S   T
0  0.0 NaN  0.0 NaN
1 -2.0 NaN  3.0 NaN
2  0.0 NaN  2.0 NaN